Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: Create an :cpp:type:`lv_image_decoder_dsc_t` variable to describe the decoding session and call :cpp:func:`lv_image_decoder_open`.
it_it: Creare una variabile :cpp:type:`lv_image_decoder_dsc_t` per descrivere la sessione di decodifica e richiamare :cpp:func:`lv_image_decoder_open`.

source: Create an Alif account and download the tools from `here <https://alifsemi.com/support/software-tools/ensemble/>`__ under "Alif Security Toolkit".
it_it: Creare un account Alif e scaricare gli strumenti da `qui <https://alifsemi.com/support/software-tools/ensemble/>`__ sotto "Alif Security Toolkit".

source: Create an Animation
it_it: Creare un'Animazione

source: Create an Animation Timeline object by calling :cpp:func:`lv_anim_timeline_create`.
it_it: Creare un oggetto Timeline di Animazione chiamando :cpp:func:`lv_anim_timeline_create`.

source: Create an Animation template but do not call :cpp:func:`lv_anim_start` on it.
it_it: Creare un template di Animazione, ma non chiamare :cpp:func:`lv_anim_start` su di esso.

source: Create and register image decoder
it_it: Crea e registra il decodificatore di immagini

source: Create beautiful UIs for any MCU, MPU and display type.
it_it: Creare splendide interfacce utente per qualsiasi MCU, MPU e tipo di display.

source: Create colors from Hue, Saturation and Value values:
it_it: Crea colori dai valori di Tonalità, Saturazione e Valore:

source: Create colors from Red, Green and Blue channel values:
it_it: Crea colori dai valori dei canali Rosso, Verde e Blu:

source: Create display and input devices
it_it: Creare dispositivi di visualizzazione e di input

source: Create display(s) (:cpp:type:`lv_display_t`) and input device(s) (:cpp:type:`lv_indev_t`) and set up their callbacks.
it_it: Creare display (:cpp:type:`lv_display_t`) e dispositivi di input (:cpp:type:`lv_indev_t`) e impostarne le callback.

source: Create flags
it_it: Creazione di flag

source: Create styles from scratch for buttons
it_it: Creare stili da zero per i pulsanti

source: Create the :ref:`Permanent Screens <xml_screen_permanent>` and other required screens.
it_it: Creare gli :ref:`Screen Permanenti <xml_screen_permanent>` e altre schermate richieste.

source: Create the STM32 HAL Project
it_it: Creare il Progetto STM32 HAL

source: Create the UI
it_it: Creare l'Interfaccia Utente

source: Create the UI.
it_it: Creare l'interfaccia utente.

source: Create the ``src`` Folder inside your sketch folder
it_it: Creare la cartella ``src`` all'interno della cartella degli sketch

source: Create the configuration (.config)
it_it: Creazione della configurazione (.config)

source: Create the first patch file
it_it: Creazione del primo file patch

source: Create the rootfs overlay structure and include the executable of the built application.
it_it: Creare la struttura di overlay rootfs e includere l'eseguibile dell'applicazione compilata.

source: Create, release, or distribute any **UI editor, visual builder, layout designer, code generator, or tool** that reads, writes, or interprets XML files using this Specification — **whether commercial, open-source, or intended for public use, use by customers or partners, or any use outside your own organization** — without written permission from LVGL LLC.
it_it: Creare, rilasciare o distribuire **editor di interfaccia utente, visual builder, layout designer, generatore di codice o strumento** che legga, scriva o interpreti file XML utilizzando questa Specifica, **sia commerciale, open source o destinato all'uso pubblico, all'uso da parte di clienti o partner, o per qualsiasi uso esterno alla propria organizzazione**, senza l'autorizzazione scritta di LVGL LLC.

source: Creating Colors
it_it: Creazione di Colori

source: Creating Components
it_it: Creazione di Componenti

source: Creating Instances
it_it: Creazione di Istanze

source: Creating Monitors
it_it: Creazione di Monitor

source: Creating Screens
it_it: Creazione di Screen

source: Creating Sections
it_it: Creazione di Sezioni

source: Creating Window Decorations
it_it: Creazione di Decorazioni per le Window

source: Creating a Display
it_it: Creazione di un Display

source: Creating a New Layer
it_it: Creazione di un Nuovo Layer

source: Creating a Tab View
it_it: Creazione di una Tab View

source: Creating a Timer
it_it: Creazione di un Timer

source: Creating an Input Device
it_it: Creazione di un Device di Input

source: Creating lv_conf.h
it_it: Creazione di lv_conf.h

source: Creating new project with LVGL
it_it: Creazione di un nuovo progetto con LVGL

source: Creating the Docker image
it_it: Creazione dell'immagine Docker

source: Creating tools to work with LVGL at a higher level (e.g. drag-and-drop designer).
it_it: Creare strumenti per lavorare con LVGL a un livello superiore (ad esempio, un designer drag-and-drop).

source: Cross-Platform compatibility: OpenGL's wide platform support enables LVGL UIs on desktop, mobile, and embedded systems.
it_it: Compatibilità Cross-Platform: L'ampio supporto di OpenGL consente l'utilizzo di interfacce utente LVGL su sistemi desktop, mobili ed embedded.

source: Crown Mode
it_it: Modalità Crown

source: Ctrl+Down
it_it: Ctrl+Giù

source: Ctrl+Shift+Down
it_it: Ctrl+Shift+Giù

source: Ctrl+Shift+Up
it_it: Ctrl+Shift+Su

source: Ctrl+Space
it_it: Ctrl+Spazio

source: Ctrl+Up
it_it: Ctrl+Su

source: Ctrl+mousewheel
it_it: Ctrl+rotellina del mouse

source: Cubic Bezier animation
it_it: Animazione di cubica di Bézier

source: Current date
it_it: Data corrente

source: Current playback position via ``lv_gstreamer_get_position()``
it_it: Posizione di riproduzione corrente tramite ``lv_gstreamer_get_position()``

source: Current playback state via ``lv_gstreamer_get_state()``
it_it: Stato di riproduzione corrente tramite ``lv_gstreamer_get_state()``

source: Current state and objectives
it_it: Stato attuale e obiettivi

source: Current value
it_it: Valore corrente

source: Current volume level via ``lv_gstreamer_get_volume()``
it_it: Livello del volume corrente tramite ``lv_gstreamer_get_volume()``

source: Currently supported:
it_it: Attualmente supportati:

source: Currently, only `screenshot_compare` steps can fail.
it_it: Attualmente, solo i passi `screenshot_compare` possono fallire.

source: Currently, only integer and string types are supported.
it_it: Attualmente, sono supportati solo i tipi intero e stringa.

source: Currently, only one multi-touch gesture can be recognized or ended at a time.
it_it: Attualmente, è possibile riconoscere o terminare un solo gesto multi-touch alla volta.

source: Currently, support for BMP and WEBP images is limited to using them as files on an external file system.
it_it: Attualmente, il supporto per le immagini BMP e WEBP è limitato all'utilizzo come file su un file system esterno.

source: Currently, there is support for GLFW and EGL.
it_it: Attualmente, sono supportati GLFW ed EGL.

source: Currently, these multi-touch gestures are supported:
it_it: Attualmente, sono supportati i seguenti gesti multi-touch:

source: Currently, two buffering methods are supported:
it_it: Attualmente sono supportati due metodi di buffering:

source: Cursor
it_it: Cursore

source: Custom Dictionary
it_it: Dizionario Personalizzato

source: Custom Environments
it_it: Ambienti Personalizzati

source: Custom Events
it_it: Eventi Personalizzati

source: Custom Image Formats
it_it: Formati Immagine Personalizzati

source: Custom Mode Selection
it_it: Selezione della Modalità Custom

source: Custom Profiler Implementation
it_it: Implementazione del Profiler Personalizzato

source: Custom Properties
it_it: Proprietà Custom

source: Custom Usage
it_it: Utilizzo Personalizzato

source: Custom buttons
it_it: Pulsanti personalizzati

source: Custom command lists
it_it: Elenchi di comandi personalizzati

source: Custom data can be bound to a table cell.
it_it: I dati personalizzati possono essere associati a una cella della tabella.

source: Custom drawer to show the current value
it_it: "Drawer" personalizzato per visualizzare il valore corrente

source: Custom formats can be supported by specifying one of the RAW color formats and using an external :ref:`image decoder <image_decoders>` to decode it.
it_it: I formati personalizzati possono essere supportati specificando uno dei formati colore RAW e utilizzando un :ref:`decoder di immagini <image_decoders>` esterno per decodificarlo.

source: Custom mode selection is currently only supported when using DRM with EGL (``LV_LINUX_DRM_USE_EGL`` enabled).
it_it: La selezione della modalità custom è attualmente supportata solo quando si utilizza DRM con EGL (``LV_LINUX_DRM_USE_EGL`` abilitato).

source: Custom recipe
it_it: Ricetta personalizzata

source: Custom scrolling animations
it_it: Animazioni di scorrimento personalizzate

source: Custom sort
it_it: Ordinamento Personalizzato

source: Custom style properties can be added which can be retrieved and used in the update callback.
it_it: È possibile aggiungere proprietà di stile personalizzate che possono essere recuperate e utilizzate nella callback di aggiornamento.

source: Custom tab view with state management
it_it: Visualizzazione a schede personalizzata con gestione dello stato

source: Custom year list
it_it: Elenco anni personalizzato

source: Customize XMLs manually or with internal utilities.
it_it: Personalizzare i file XML manualmente o con utilità interne.

source: Customize circular scrolling animation
it_it: Personalizzazione dell'animazione a scorrimento circolare

source: Customize the visual appearance of your 3D scene:
it_it: Personalizzare l'aspetto visivo della scena 3D:

source: Customizing scale major tick label color with `LV_EVENT_DRAW_TASK_ADDED` event
it_it: Personalizzazione del colore dell'etichetta principale della scala con l'evento `LV_EVENT_DRAW_TASK_ADDED`

source: Customizing the dictionary is very simple.
it_it: Personalizzare il dizionario è molto semplice.

source: DMA or other hardware should be used to transfer data to the display so the MCU can continue drawing.
it_it: È necessario utilizzare DMA o altro hardware per trasferire i dati al display in modo che la MCU possa continuare a disegnare.

source: DMA2D usage can be freely mixed with LTDC usage as long as ``LV_ST_LTDC_USE_DMA2D_FLUSH`` is **not** enabled.
it_it: L'utilizzo di DMA2D può essere liberamente combinato con l'utilizzo di LTDC purché ``LV_ST_LTDC_USE_DMA2D_FLUSH`` **non** sia abilitato.

source: DPI (default is configured :c:macro:`LV_DPI_DEF` in ``lv_conf.h``, but can be modified with :cpp:expr:`lv_display_set_dpi(disp, new_dpi)`).
it_it: DPI (il valore di default è :c:macro:`LV_DPI_DEF` in ``lv_conf.h``, ma può essere modificato con :cpp:expr:`lv_display_set_dpi(disp, new_dpi)`).

source: DPI Independent Unit
it_it: Unità Indipendente dai DPI

source: DRM requires proper modesetting.
it_it: DRM richiede un'impostazione di modalità corretta.

source: Data binding (Subjects)
it_it: Data binding (I Subject)

source: Data corruption caused by other thread logs inserted during the printing of trace logs.
it_it: Corruzione dei dati causato da log di altri thread inseriti durante la stampa dei log di tracing.

source: Data points can also be illustrated if their ``width``, ``height``, ``bg_color`` and ``radius`` styles (for :cpp:enumerator:`LV_PART_ITEMS`) are set and both ``width`` and ``height`` have non-zero values.
it_it: I punti dati possono anche essere visualizzati se i relativi stili ``width``, ``height``, ``bg_color`` e ``radius`` (per :cpp:enumerator:`LV_PART_ITEMS`) sono impostati e sia ``width`` che ``height`` hanno valori diversi da zero.

source: Data series
it_it: Serie di dati

source: Dave2D GPU
it_it: GPU Dave2D

source: Dave2D is capable of accelerating most of the drawing operations of LVGL:
it_it: Dave2D è in grado di accelerare la maggior parte delle operazioni di disegno di LVGL:

source: De-initialize image decoder
it_it: Deinizializza il decodificatore di immagini

source: Debug button
it_it: Pulsante Debug

source: Debugger parameters for RA6
it_it: Parametri del debugger per RA6

source: Debugger parameters for RA8
it_it: Parametri del debugger per RA8

source: Debugger parameters for RX72
it_it: Parametri del debugger per RX72

source: Debugging LVGL with GDB
it_it: Debug di LVGL con GDB

source: Debugging and logging
it_it: Debug e logging

source: Declare it either as a global variable or as a static variable inside a function.
it_it: Dichiaralo come variabile globale o come variabile statica all'interno di una funzione.

source: Declare the font using :cpp:expr:`LV_FONT_DECLARE(my_font_name)`.
it_it: Dichiarare il font utilizzando :cpp:expr:`LV_FONT_DECLARE(my_font_name)`.

source: Declare variables where needed (not all at function start).
it_it: Dichiarare le variabili dove necessario (non tutte all'inizio della funzione).

source: Decode image
it_it: Decodifica immagine

source: Decode video
it_it: Decodifica video

source: Decoupling the Display Refresh Timer
it_it: Disaccoppiamento del Timer di Aggiornamento del Display

source: Default Behavior
it_it: Comportamento di Default

source: Default Display
it_it: Display di Default

source: Default Group
it_it: Gruppo di Default

source: Default Refresh Behavior
it_it: Comportamento del Refresh di Default

source: Default ``INT32_MAX``
it_it: Il default è ``INT32_MAX``

source: Default ``INT32_MIN``
it_it: Il default è ``INT32_MIN``

source: Default ``false``
it_it: Il default è ``false``.

source: Default control maps are preconfigured to only show the pop-overs on keys that produce a symbol (i.e. not on space).
it_it: Le mappe di controllo di default sono preconfigurate per mostrare i pop-over solo sui tasti che producono un simbolo (ovvero non sulla barra spaziatrice).

source: Default height and width set to :cpp:enumerator:`LV_SIZE_CONTENT`
it_it: Altezza e larghezza di default impostate su :cpp:enumerator:`LV_SIZE_CONTENT`

source: Default implementation for FreeRTOS in lv_pxp_osa.c.
it_it: Implementazione di default per FreeRTOS in lv_pxp_osa.c.

source: Default is 0.
it_it: Il default è 0.

source: Default is ``false``.
it_it: Il default è ``false``.

source: Default is empty (no extras).
it_it: Il default è vuoto (nessun carattere aggiuntivo).

source: Default lottie is 60fps, embedded LCDs likely won't go above 30fps.
it_it: Il lottie di default è 60 fps, gli LCD embedded probabilmente non supereranno i 30 fps.

source: Default period: 300ms (``LV_SYSMON_REFR_PERIOD_DEF``)
it_it: Periodo di default: 300ms (``LV_SYSMON_REFR_PERIOD_DEF``)

source: Default resolution issue
it_it: Problema della risoluzione di default

source: Default values
it_it: Valori di default

source: Default: ``"clicked"``.
it_it: Il default: ``"clicked"``.

source: Default: ``"none"``.
it_it: Il default: ``"none"``.

source: Default: ``0``.
it_it: Il default: ``0``.

source: Default: ``main|default``.
it_it: Il default: ``main|default``.

source: Define an image descriptor variable with the corresponding TSC color format and the GPU will be able to draw it directly.
it_it: Definire una variabile descrittore di immagine con il formato colore TSC corrispondente e la GPU sarà in grado di disegnarla direttamente.

source: Define the arc size (angular span) using :cpp:expr:`lv_arclabel_set_angle_size(arclabel, size)`.
it_it: Definire la dimensione dell'arco (ampiezza angolare) utilizzando :cpp:expr:`lv_arclabel_set_angle_size(arclabel, size)`.

source: Defines
it_it: Define

source: Defines how much space to take proportionally from the free space of the Widget's track
it_it: Definisce quanto spazio occupare proporzionalmente dallo spazio libero della traccia del Widget.

source: Defines how to align the children in the direction of flex flow
it_it: Definisce come allineare i figli nella direzione del flusso del Flex.

source: Defines how to align the children perpendicular to the direction of flex flow
it_it: Definisce come allineare i figli perpendicolarmente alla direzione del flusso del Flex.

source: Defines how to align the tracks of the flow
it_it: Definisce come allineare le tracce del flusso.

source: Defines how to blend image pixels with the background.
it_it: Definisce come fondere i pixel dell'immagine con lo sfondo.

source: Defines how to distribute the columns
it_it: Definisce come distribuire le colonne.

source: Defines how to distribute the rows.
it_it: Definisce come distribuire le righe.

source: Defines in which direct the flex layout should arrange the children
it_it: Definisce in quale direzione il layout Flex deve disporre i figli.

source: Defining Timelines
it_it: Definizione delle Timeline

source: Defining subjects
it_it: Definizione dei Subject

source: Degrees with 0.1 resolution
it_it: Gradi con risoluzione 0,1.

source: Delete Font
it_it: Eliminare Font

source: Delete Font Manager
it_it: Eliminare il Font Manager

source: Delete character
it_it: Eliminare un carattere

source: Deleting Animations
it_it: Eliminazione di Animazioni

source: Demo Application
it_it: Applicazione Demo

source: Demonstrate RTL direction on grid
it_it: Direzione RTL sulla griglia

source: Demonstrate cell placement and span
it_it: Posizionamento e ampiezza delle celle

source: Demonstrate column and row gap
it_it: Spazi tra colonne e righe

source: Demonstrate column and row gap style properties
it_it: Dimostrazione delle proprietà di stile degli spazi tra colonne e righe

source: Demonstrate flex grow
it_it: Dimostrazione della flex grow.

source: Demonstrate grid's -free unit-
it_it: La -free unit- della grid

source: Demonstrate track placement
it_it: Posizionamento delle tracce

source: Demos and Examples
it_it: Demo ed Esempi

source: Dependencies
it_it: Dipendenze

source: Depending on the RT platform used, the acceleration can be done by NXP PXP (PiXel Pipeline) and/or the Verisilicon GPU through an API named VGLite.
it_it: A seconda della piattaforma RT utilizzata, l'accelerazione può essere eseguita da NXP PXP (PiXel Pipeline) e/o dalla GPU Verisilicon tramite un'API denominata VGLite.

source: Depending on the ``<api>``, a function like this is generated:
it_it: A seconda di ``<api>``, viene generata una funzione come questa:

source: Depending on the application, it might be necessary to update the rootfs.
it_it: A seconda dell'applicazione, potrebbe essere necessario aggiornare il rootfs.

source: Depending on the configuration, you may find files like ``rootfs.tar``, ``zImage``, ``uImage``, or others that are ready to be deployed onto the target hardware.
it_it: A seconda della configurazione, si potrebbero trovare file come ``rootfs.tar``, ``zImage``, ``uImage``, o altri, pronti per essere distribuiti sull'hardware target.

source: Depending on the widget's type, a short or long press changes back to *Navigate* mode.
it_it: A seconda del tipo di widget, una pressione breve o prolungata riporta alla modalità *Navigate*.

source: Depending on your system, the device node paths might not be stable across reboots.
it_it: A seconda del sistema, i path dei nodi dei dispositivi potrebbero non essere stabili dopo i riavvii.

source: Deploying the container image to the device
it_it: Deploy dell'immagine del container sul dispositivo

source: Describe function parameters with the ``@param`` command.
it_it: Descrivere i parametri della funzione col comando ``@param``.

source: Describe return values with the ``@return`` command.
it_it: Descrivere i valori restituiti col comando ``@return``.

source: Describe what is in the update.
it_it: Descrivere il contenuto dell'aggiornamento.

source: Describe your UI declaratively and load it at runtime without having to recompile firmware.
it_it: Descrivere l'interfaccia utente in modo dichiarativo e caricarla in fase di esecuzione senza dover ricompilare il firmware.

source: Describes how to blend the colors to the background.
it_it: Descrive come sfumare i colori sullo sfondo.

source: Description
it_it: Descrizione

source: Descriptions of parameters do not need periods after them unless they are full sentences.
it_it: Le descrizioni dei parametri non necessitano di punti dopo di esse, a meno che non siano frasi complete.

source: Design Considerations
it_it: Considerazioni Progettuali

source: Designed for resource-constrained devices, the minimum kernel requires only 1.2KB of RAM and 3 KB of Flash.
it_it: Progettato per dispositivi con risorse limitate, il kernel minimo richiede solo 1,2 KB di RAM e 3 KB di Flash.

source: Details
it_it: Dettagli

source: Details of the Windows driver are provided below.
it_it: I dettagli del driver Windows sono forniti di seguito.

source: Develop GUI in Linux first and when it is done just compile it for NuttX.
it_it: Sviluppare prima la GUI in Linux e, una volta completata, compilarla per NuttX.

source: Develop GUI in Python, a very popular high level language.
it_it: Sviluppo di GUI in Python, un linguaggio di alto livello molto diffuso.

source: Develop in Online VSCode (GitHub Codespaces)
it_it: Sviluppo in VSCode online (GitHub Codespaces)

source: Develop in online VSCode using **GitHub Codespaces**
it_it: Sviluppare in VSCode online utilizzando **GitHub Codespaces**

source: Developers don't need to manually install and configure tools and libraries; everything needed is included in the SDK.
it_it: Gli sviluppatori non devono installare e configurare manualmente strumenti e librerie; tutto il necessario è incluso nell'SDK.

source: Dictionary format
it_it: Formato del dizionario

source: Different from the Label Widget, Spangroups can render text styled with different fonts, colors, and sizes into the Spangroup Widget.
it_it: A differenza del Widget Label, gli Spangroup possono visualizzare testo con stili diversi, con colori e dimensioni diversi.

source: Diffuse/albedo textures
it_it: Texture diffuse/albedo

source: Direct Rendering
it_it: Rendering Diretto

source: Direction
it_it: Direzione

source: Discover and run all ``test*.xml`` files.
it_it: Rileva ed esegue tutti i file ``test*.xml``.

source: Display Configuration
it_it: Configurazione del Display

source: Display Controller Support
it_it: Supporto del Controller del Display

source: Display Driver
it_it: Driver del Display

source: Display Emulation
it_it: Emulazione del Display

source: Display Events
it_it: Eventi del Display

source: Display Integration
it_it: Integrazione del Display

source: Display Interface
it_it: Interfaccia al Display

source: Display Rotation
it_it: Rotazione del Display

source: Display Size: 9"
it_it: Dimensioni Display: 9"

source: Display and Touch
it_it: Display e Touch

source: Display buffer: > *"Horizontal resolution"* pixels (> 10 X *"Horizontal resolution"* is recommended)
it_it: Buffer di visualizzazione: > *"Risoluzione orizzontale"* pixel (>10 X *"Risoluzione orizzontale"*)

source: Display data can be stored in the on-chip display data RAM of 132 x 162 x 18 bits.
it_it: I dati del display possono essere memorizzati nella RAM integrata del display da 132 x 162 x 18 bit.

source: Display data can be stored in the on-chip display data RAM of 240x320x18 bits.
it_it: I dati del display possono essere memorizzati nella RAM integrata da 240x320x18 bit.

source: Display data can be stored in the on-chip display data RAM of 320x480x18 bits.
it_it: I dati del display possono essere memorizzati nella RAM integrata da 320x480x18 bit.

source: Display drivers:
it_it: Driver per display:

source: Display emulation
it_it: Emulazione del display

source: Display format:
it_it: Formato del Display:

source: Display timers will stay paused when there is no reason to refresh.
it_it: I timer del display rimarranno in pausa quando non c'è motivo di aggiornarli.

source: Display, mouse, and keyboard support
it_it: Supporto per display, mouse e tastiera

source: Displays
it_it: Display
